Revit 2017 API
StructuralSectionZProfile Class
 Defines parameters for Z Profile structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionZProfile : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionZProfile _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionZProfile : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
See Also
StructuralSectionZProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace